In [2]:
import numpy as np
import pandas as pd

##### Pivot Tables

In [3]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    456     54   John  January      Q1
1  2023-01-02       B   West    574     91   Mary  January      Q1
2  2023-01-03       C  North    987     47    Bob  January      Q1
3  2023-01-04       D  South    880     78  Alice  January      Q1
4  2023-01-05       A   East    749     94   John  January      Q1
5  2023-01-06       B   West    263     96   Mary  January      Q1
6  2023-01-07       C  North    842     12    Bob  January      Q1
7  2023-01-08       D  South    826     29  Alice  January      Q1
8  2023-01-09       A   East    736     66   John  January      Q1
9  2023-01-10       B   West    608     50   Mary  January      Q1
10 2023-01-11       C  North    936     16    Bob  January      Q1
11 2023-01-12       D  South    362     73  Alice  January      Q1
12 2023-01-13       A   East    233     86   John  January      Q1
13 2023-01-14       B   West    892     40   Mary  January      Q1
14 2023-01-15       C  North    897     63    Bob  January      Q1
15 2023-01-16       D  South    830     54  Alice  January      Q1
16 2023-01-17       A   East    522     50   John  January      Q1
17 2023-01-18       B   West    287     64   Mary  January      Q1
18 2023-01-19       C  North    314     94    Bob  January      Q1
19 2023-01-20       D  South    799     93  Alice  January      Q1

In [7]:
pd.pivot_table(df, values='Sales', index='Region', columns='Product', aggfunc='median')

Product      A      B      C      D
Region
East     522.0    NaN    NaN    NaN
North      NaN    NaN  897.0    NaN
South      NaN    NaN    NaN  826.0
West       NaN  574.0    NaN    NaN

In [8]:
pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product', aggfunc='median')

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     522.0    NaN    NaN    NaN  66.0   NaN   NaN   NaN
North      NaN    NaN  897.0    NaN   NaN   NaN  47.0   NaN
South      NaN    NaN    NaN  826.0   NaN   NaN   NaN  73.0
West       NaN  574.0    NaN    NaN   NaN  64.0   NaN   NaN

##### Cross Tabs

In [10]:
pd.crosstab(df['Region'], df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0